Revit 2024 API
ClosestPointsPairBetweenTwoCurves.XYZPointOnFirstCurve Property
 Point on the first curve in 3d coordinates.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public XYZ XYZPointOnFirstCurve { get; set; }
Visual Basic
Public Property XYZPointOnFirstCurve As XYZ
	Get
	Set
Visual C++
public:
property XYZ^ XYZPointOnFirstCurve {
	XYZ^ get ();
	void set (XYZ^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
Autodesk.Revit.Exceptions.InvalidOperationException |  The property has not been set by the method providing the result.
See Also
ClosestPointsPairBetweenTwoCurves Class
Autodesk.Revit.DB Namespace